{
  "timestamp": "2025-09-27T03:35:14.740Z",
  "version": "1.0",
  "users": [
    {
      "id": 5,
      "username": "roshan",
      "password": "$2a$10$F1mLYCfQkWAj0F6li2M9C.ld8cV.VTWm3m0rfZ5q4PBKXRGgmKQ/y",
      "currentVerse": 1,
      "completedVerses": "[]",
      "createdAt": "2025-09-27T03:17:22.080Z",
      "updatedAt": "2025-09-27T03:17:22.080Z"
    },
    {
      "id": 6,
      "username": "testdashboard",
      "password": "$2a$10$Q/Hc6.i6NiHAuUcw/T603.3S/Z.xGkIZVl85Fmy0I9qdrzGVwr6QO",
      "currentVerse": 1,
      "completedVerses": "[]",
      "createdAt": "2025-09-27T03:21:06.935Z",
      "updatedAt": "2025-09-27T03:21:06.935Z"
    }
  ],
  "verses": [
    {
      "id": 1,
      "title": "The Humor Helix",
      "description": "Arthur slumps in his chair, head in hands. 'It's gone,' he whispers. 'The laughter... the spark. I can't even remember what's supposed to be funny anymore.' He looks around his cluttered studio, hoping for inspiration. Suddenly, three oddities catch his eye... Help Arthur rediscover the essence of humor by solving a puzzle that reveals what is truly funny.",
      "clues": "Three clues are displayed before you: [Image 1: /images/verse 5/punch image.jpeg] A cartoon-style red boxing glove with sunburst background. [Image 2: /images/verse 5/fishing image.jpeg] A peaceful fishing scene showing someone casting a line. [Riddle] 'I deliver a sudden impact, but leave no bruise. I stretch out long and thin, to catch a laugh, not fish. What am I, that makes us grin?'",
      "answer": "PUNCHLINE",
      "orderIndex": 1,
      "isActive": true,
      "createdAt": "2025-09-27T03:00:26.823Z",
      "updatedAt": "2025-09-27T03:00:26.823Z"
    },
    {
      "id": 2,
      "title": "The Analog Sunset",
      "description": "Leo rummaged through a dusty old box in his attic, a wave of nostalgia washing over him. \"Here it is!\" he exclaimed, holding up a scratched DVD case for the 2000s blockbuster, 'Cyber Voyager'. He was so excited to show the classic sci-fi film to his younger cousin, Zara. But when he plugged in his old player, the screen just flickered: \"ERROR\".\n\nZara tilted her head. \"A disc? Why don't we just... you know... watch it now?\" She tapped her smart TV, and a familiar grid of colorful app icons appeared. Leo was baffled. He had the movie right here in his hand, but it was useless. To watch it, he had to embrace a completely new way.\n\nLeo needs to adapt to the modern way of watching movies. What single word describes this necessary leap forward?",
      "clues": "Visual clues guide you: [Clue 1] An image of a dusty, bulky DVD player from the early 2000s. A physical DVD disc is halfway out of the tray. The small digital display on the player reads \"NO DISC\". [Clue 2] A sleek, modern smart TV screen displaying a vibrant grid of app icons. The logos for Netflix, Hulu, and Disney+ are clearly visible and in focus.",
      "answer": "STREAM",
      "orderIndex": 2,
      "isActive": true,
      "createdAt": "2025-09-27T03:00:26.823Z",
      "updatedAt": "2025-09-27T03:00:26.823Z"
    },
    {
      "id": 3,
      "title": "The Titan's Gift",
      "description": "The Titan Prometheus gifted fire to humanity, a flame of knowledge and warmth that forever changed our destiny. But every flame casts a shadow, every gift carries a weight. Some burdens, like the Titan's own, feel too heavy to carry alone. They fester in silence, growing heavier in the dark. Your challenge is to decipher the wisdom hidden in this ancient tale. Look at the symbols—one of an immense weight, the other of division and connection. What single word unlocks the secret to easing such a burden?",
      "clues": "Visual clues guide your understanding: [Clue 1] An image of the Titan Atlas, straining as he holds the celestial spheres (the world) on his shoulders - representing an immense emotional burden or stress one person is carrying alone. [Clue 2] A simple diagram of two overlapping circles (a Venn diagram), with the intersecting area highlighted - visually representing the act of creating an overlapping, common space where something that was once separate is now held jointly.",
      "answer": "SHARE",
      "orderIndex": 3,
      "isActive": true,
      "createdAt": "2025-09-27T03:00:26.823Z",
      "updatedAt": "2025-09-27T03:00:26.823Z"
    }
  ],
  "totalUsers": 2,
  "totalVerses": 3
}